In [1]:
import numpy as np
import pandas as pd

In [29]:
pd.DataFrame([{'aa':1,'bb':2},{'bb':3,'cc':6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [30]:
pd.DataFrame(np.random.randint(2,12),
            columns=['foo','bar'],
            index=['a','b','c'])

   foo  bar
a    2    2
b    2    2
c    2    2

In [31]:
ind=pd.Index([20,34,57,7,1,8])
ind

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [32]:
ind[1]

34

In [33]:
ind[::]

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [34]:
print(ind.size,ind.shape,ind.ndim,ind.dtype)

6 (6,) 1 int64

In [35]:
rng=np.random.RandomState(15)
ser=pd.Series(rng.randint(0,10,4))
ser

0    8
1    5
2    5
3    7
dtype: int32

In [36]:
dfr=pd.DataFrame(rng.randint(0,10,(5,4)),
                columns=['a','b','c','d'])
dfr

   a  b  c  d
0  0  7  5  6
1  1  7  0  4
2  9  7  5  3
3  6  8  2  1
4  1  0  5  2

In [37]:
np.exp(ser)

0    2980.957987
1     148.413159
2     148.413159
3    1096.633158
dtype: float64

In [38]:
np.sin(dfr*np.pi/4)

          a             b         c             d
0  0.000000 -7.071068e-01 -0.707107 -1.000000e+00
1  0.707107 -7.071068e-01  0.000000  1.224647e-16
2  0.707107 -7.071068e-01 -0.707107  7.071068e-01
3 -1.000000 -2.449294e-16  1.000000  7.071068e-01
4  0.707107  0.000000e+00 -0.707107  1.000000e+00

In [39]:
area=pd.Series({'alaska':1723337,'texas':695662,'california':423967},name='area')
population=pd.Series({'california':38332521,'texas':26448193,'new york':19651127},name='population')
print(area)
population

alaska        1723337
texas          695662
california     423967
Name: area, dtype: int64

california    38332521
texas         26448193
new york      19651127
Name: population, dtype: int64

In [40]:
population/area

alaska              NaN
california    90.413926
new york            NaN
texas         38.018740
dtype: float64

In [41]:
area.index|population.index

Index(['alaska', 'california', 'new york', 'texas'], dtype='object')

In [42]:
a=pd.Series([2,4,6],index=[0,1,2])
b=pd.Series([1,3,5],index=[1,2,3])
print(a)
print(b)
b
a+b

0    2
1    4
2    6
dtype: int64
1    1
2    3
3    5
dtype: int64

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [43]:
a.add(b,fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [47]:
data={"province":["fl","fl","nh","nh","zh"],
      "year":[2013,2014,2013,2014,2014],
      "literacy":[0.2,0.1,0.5,0.3,0.5]}
print(data)
data=pd.DataFrame(data)
data

{'province': ['fl', 'fl', 'nh', 'nh', 'zh'], 'year': [2013, 2014, 2013, 2014, 2014], 'literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  province  year  literacy
0       fl  2013       0.2
1       fl  2014       0.1
2       nh  2013       0.5
3       nh  2014       0.3
4       zh  2014       0.5

In [48]:
df=pd.DataFrame(data,columns=["year","province","literacy"])
df

   year province  literacy
0  2013       fl       0.2
1  2014       fl       0.1
2  2013       nh       0.5
3  2014       nh       0.3
4  2014       zh       0.5

In [49]:
df['nonsense']=df.year/df.literacy
df

   year province  literacy      nonsense
0  2013       fl       0.2  10065.000000
1  2014       fl       0.1  20140.000000
2  2013       nh       0.5   4026.000000
3  2014       nh       0.3   6713.333333
4  2014       zh       0.5   4028.000000

In [50]:
df['series_aligned']=pd.Series(range(5),index=[0,1,2,3,4])
df

   year province  literacy      nonsense  series_aligned
0  2013       fl       0.2  10065.000000               0
1  2014       fl       0.1  20140.000000               1
2  2013       nh       0.5   4026.000000               2
3  2014       nh       0.3   6713.333333               3
4  2014       zh       0.5   4028.000000               4

In [51]:
df

   year province  literacy      nonsense  series_aligned
0  2013       fl       0.2  10065.000000               0
1  2014       fl       0.1  20140.000000               1
2  2013       nh       0.5   4026.000000               2
3  2014       nh       0.3   6713.333333               3
4  2014       zh       0.5   4028.000000               4

In [52]:
df2=pd.DataFrame({"province":['fl','nh','zh'],"population":["100000","200000","30000"]})
df2

  province population
0       fl     100000
1       nh     200000
2       zh      30000

In [53]:
df.merge(df2)

   year province  literacy      nonsense  series_aligned population
0  2013       fl       0.2  10065.000000               0     100000
1  2014       fl       0.1  20140.000000               1     100000
2  2013       nh       0.5   4026.000000               2     200000
3  2014       nh       0.3   6713.333333               3     200000
4  2014       zh       0.5   4028.000000               4      30000

In [54]:
df3=pd.DataFrame({"province":['fl','nh'],"population":["100000","200000"]})
df3
df3.merge(df3,right_on='province',left_on='province')

  province population_x population_y
0       fl       100000       100000
1       nh       200000       200000

In [55]:
df4=pd.DataFrame({"province":['fl','nh','ut'],"population":["100000","200000","500000"]})
df.merge(df4,how='outer')

     year province  literacy      nonsense  series_aligned population
0  2013.0       fl       0.2  10065.000000             0.0     100000
1  2014.0       fl       0.1  20140.000000             1.0     100000
2  2013.0       nh       0.5   4026.000000             2.0     200000
3  2014.0       nh       0.3   6713.333333             3.0     200000
4  2014.0       zh       0.5   4028.000000             4.0        NaN
5     NaN       ut       NaN           NaN             NaN     500000

In [56]:
df5=pd.DataFrame({'province':['fl','nh','fl'],"population":["100000","200000","50000"]})
print(df)
df.merge(df5,how='outer')

   year province  literacy      nonsense  series_aligned
0  2013       fl       0.2  10065.000000               0
1  2014       fl       0.1  20140.000000               1
2  2013       nh       0.5   4026.000000               2
3  2014       nh       0.3   6713.333333               3
4  2014       zh       0.5   4028.000000               4

   year province  literacy      nonsense  series_aligned population
0  2013       fl       0.2  10065.000000               0     100000
1  2013       fl       0.2  10065.000000               0      50000
2  2014       fl       0.1  20140.000000               1     100000
3  2014       fl       0.1  20140.000000               1      50000
4  2013       nh       0.5   4026.000000               2     200000
5  2014       nh       0.3   6713.333333               3     200000
6  2014       zh       0.5   4028.000000               4        NaN

In [60]:
serie_a=pd.Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],
                 index=['f','e','d','c','b','a'])
serie_b=pd.Series(np.arange(len(serie_a),dtype=np.float64),
                 index=['f','e','d','c','b','a'])

In [61]:
serie_a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [62]:
serie_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [63]:
pd.Series(np.where(pd.isnull(serie_a),serie_b,serie_a),index=serie_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [65]:
serie_a.combine_first(serie_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64